{
    "title": "On-board the Stride blockchain for ICS",
    "description": "On-board the Stride blockchain for ICS\n\n**Summary**  \nStride’s ICS signaling proposal, passed by Cosmos Hub governance on May 11th, established social consensus around the terms of Stride’s admission into the ATOM Economic Zone and adoption of interchain security. But no actual changes have yet been implemented. In order to implement Stride’s ICS signaling proposal, two concurrent executable proposals are needed.  \nThis is the first of two executable proposals. This proposal is to on-board the Stride blockchain for interchain security.  \nAssuming this proposal passes, the Stride blockchain will transition to interchain security on July 17th at 1pm UTC.\n\n**Details**\n\nAs Stride is a live blockchain, the changeover from sovereign to consumer chain works a bit differently than launching a new chain on ICS. On June 8, Stride successfully completed a changeover on the official Cosmos Hub testnet with 40+ validators. A second rehearsal is scheduled for June 21st.\n\nThis is the sequence of events:\n\nPhase I - setup\n\n1. Hub proposal goes live on June 8th*\n2. Hub proposal passes on June 22nd\n3. Stride passes a software upgrade proposal in July, with a target height of 4614625 (3 blocks before initial_height on the Hub light client). This targets a changeover at 2023-07-17T13:00:00Z\n\nPhase II - launch\n\n1. June 16th - before the spawn time, the Hub validator set must run a Stride full node, assign their consensus keys, and sync with the Stride chain\n2. Spawn time occurs at 2023-07-17T01:00:00Z, 12 hours before the scheduled upgrade.**\n3. A genesis file will be provided to Stride validators so they can execute the upgrade \n4. Around 2023-07-17T13:00:00Z and block 4614625 on Stride, Stride will halt. The current Stride validator set must execute the upgrade. During the upgrade, the validator set will switch, and shortly after the upgrade the Hub validator set will start signing blocks.\n5. An ICS connection must be opened between the new light clients on Stride&lt;>Cosmos Hub\n\n*Since Stride is transitioning from a live chain to an ICS chain, the genesis hash can’t be known in advance (the ccv state must be exported after spawn time, and the genesis file otherwise isn’t used). The value is simply sha256(genesis_hash). The binary may also have a few small tweaks before the upgrade. It’ll be frozen at least 7 days before, so that the code can be audited and shared by the Stride team.\n\n**Spawn time must occur before the upgrade on Stride. To create the light client, we must know the Stride upgrade height in advance - given we’re estimating it 39 days in advance, we’re giving ourselves a buffer of 12 hours. If Stride block production is too fast, it will be slowed down through validator coordination on Stride.  \n**Hub requirements**\n\n* * *\n\n- **Stride binary** - will be provided at a later date.\n\n- **Stride genesis** - will be provided shortly before launch. The final genesis file will be provided before the spawn time.\n\n- **Repositories**\n\n  - [Network](https://github.com/Stride-Labs/stride)\n  - [Launch Event](https://github.com/Stride-Labs/mainnet)\n\n- **Genesis file details:**\n\n  - **Chain type and version:**\n\n    - Cosmos-SDK v0.47.1\n    - Go version: v1.20\n\n  - **Economic parameters:**\n\n    - Default fee token: ustrd.\n    - Fee split between consumer and provider: 15% Hub / 85% Stride\n\n  - **Network parameters**\n\n    - Soft_opt_out_threshold: 0.05 (e.g. 5% of the voting power)\n\n- **Ongoing involvement required from Hub validators (e.g., Governance structure, monitoring communication platforms, hardware requirements):**\n\n  - **No required governance involvement:** Stride’s governance is facilitated by Stride governors. No involvement from Hub validators is required.\n\n  - **Dedicated communications channels:**\n\n    - [Discord](https://discord.com/channels/988945059783278602/1017374233891975178): a dedicated channel has been created for Cosmos Hub validators.\n\n  - **Hardware requirements:**\n\n    - 4 Cores\n    - 32 GB RAM\n    - 2x512 GB SSD\n\n**Governance votes**\n\nThe following items describe the voting options and their significance for this proposal:\n\n-**YES**: You wish to on-board the Stride blockchain for interchain security, as previously agreed upon in Stride’s ICS proposal\n\n-**NO**: You do not wish to on-board the Stride blockchain for interchain security\n\n-**NO WITH VETO**: You 1) consider this proposal to be spam, 2) believe it infringes on minority interests, or 3) believe it violates the rules of engagement as currently set out by Cosmos Hub governance. If the number of NoWithVeto votes is greater than a third of total votes, the proposal is rejected and the deposits are burned\n\n**ABSTAIN**: You wish to contribute to quorum but you formally decline to vote either for or against the proposal\n\nFor full details, refer to Stride’s ICS forum post:\n\n<https://forum.cosmos.network/t/proposal-794-vote-onchain-stride-to-join-atom-economic-zone-and-adopt-ics/10418>\n",
    "chain_id": "stride-1",
    "initial_height": {
        "revision_number": 1,
        "revision_height": 4586376
    },
    "genesis_hash": "d68f4eb0505b5fa393b31405cdb7925ceaae56480bd8548d710b941e27f63dc1",
    "binary_hash": "2f3a78cf34d778c6e9d88215685d3b5a346c7325e51a1b12b53ffa3418af520c",
    "spawn_time": "2023-07-17T01:00:00Z", 
    "deposit": "1000000uatom",
    "consumer_redistribution_fraction": "0.85",
    "blocks_per_distribution_transmission": 1000,
    "ccv_timeout_period": 2419200000000000,
    "transfer_timeout_period": 3600000000000,
    "historical_entries": 10000,
    "unbonding_period": 1209600000000000
}
