{
  "title": "Provide 450K ATOM to Stride’s stATOM liquidity pool",
  "description": "# Provide 450K ATOM to Stride’s stATOM liquidity pool\n\n## Summary\n\nStride’s ICS signaling proposal, passed by Cosmos Hub governance on May 11th, established social consensus around the terms of Stride’s admission into the ATOM Economic Zone and adoption of interchain security. But no actual changes have yet been implemented. In order to implement Stride’s ICS signaling proposal, two concurrent executable proposals are needed.\n\nThis is the second of two executable proposals. This proposal is to provide 450,000 ATOM from the community pool to the stATOM/ATOM liquidity pool on Astroport Neutron.\n\nThis liquidity will benefit Stride and Neutron, both members of the ATOM Economic Zone. For Stride, more stATOM liquidity further strengthens the stATOM-ATOM peg, which will enable increased stATOM collateralization. For Neutron, stATOM liquidity will generate transaction fees and MEV revenue. The success of Stride and Neutron is the success of Cosmos Hub, since both share their block rewards with Cosmos Hub.\n\n\n\n## Details\n\n\nAccording to the agreed upon terms in Stride’s ICS proposal, this 450K ATOM will be stewarded by the ATOM Accelerator DAO. Established by Cosmos Hub prop 95, the ATOM Accelerator is comprised of several known, respected, and trusted members of the Cosmos Hub community.\n\nUpon receipt of the 450K ATOM, the members of the ATOM Accelerator will use it to establish an stATOM/ATOM liquidity position on Astroport Neutron. After the liquidity position has been established, the ATOM Accelerator won’t touch the liquidity unless instructed to via a Cosmos Hub signaling proposal.\n\nThe ATOM Accelerator’s stewardship of this liquidity is temporary. If an alternative arrangement to steward this liquidity is not established by Cosmos Hub governance before October 1st, 2023, then on that date the ATOM Accelerator will begin the process of returning the full 450K ATOM to the community pool.\n\n\n### Governance votes\nThe following items describe the voting options and their significance for this proposal:\n- **YES**: You wish to implement the provision of 450K ATOM to an stATOM/ATOM pool on Astroport Neutron, as previously agreed upon in Stride’s ICS signaling prop\n- **NO**: You do not wish to implement the liquidity provisioning agreement\n- **NO WITH VETO**: You 1) consider this proposal to be spam, 2) believe it infringes on minority interests, or 3) believe it violates the rules of engagement as currently set out by Cosmos Hub governance. If the number of NoWithVeto votes is greater than a third of total votes, the proposal is rejected and the deposits are burned\n- **ABSTAIN**: You wish to contribute to quorum but you formally decline to vote either for or against the proposal\n\nFor full details, refer to Stride’s ICS forum post:\nhttps://forum.cosmos.network/t/proposal-794-vote-onchain-stride-to-join-atom-economic-zone-and-adopt-ics/10418\n",
  "recipient": "cosmos1jggracsvp6fkw0ktf544lpda6dwrrxggx9a20n", 
  "amount": "450000000000uatom",
  "deposit": "1000000uatom"
}